; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v4 - type_2 ?v3 - type_1)
 	      (pred_2 ?v5 - object ?v3 - type_1)
	      (pred_3 ?v4 - type_2 ?v1 - type_3)
	      (pred_1 ?v4 - type_2 ?v5 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v4 - type_2 ?v6 ?v8 - type_1)
       :precondition (and  (pred_4 ?v4 ?v6))
       :effect (and  (pred_4 ?v4 ?v8)
		     (not (pred_4 ?v4 ?v6))))

   (:action op_2
       :parameters (?v4 - type_2 ?v2 - object ?v7 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v7) (pred_4 ?v4 ?v7) (pred_3 ?v4 ?v1))
       :effect (and (pred_1 ?v4 ?v2 ?v1)
		    (not (pred_2 ?v2 ?v7)) 
		    (not (pred_3 ?v4 ?v1))))

   (:action op_3
       :parameters (?v4 - type_2 ?v2 - object ?v7 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v2 ?v1) (pred_4 ?v4 ?v7))
       :effect (and (pred_2 ?v2 ?v7)
		    (pred_3 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v2 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_14 - type_2
obj_02 obj_11 obj_10 obj_09 - type_3
obj_07 obj_03 obj_13 obj_05 - type_1
obj_08 obj_04 obj_01 obj_06 - object)
(:init
(pred_4 obj_12 obj_07)
(pred_3 obj_12 obj_02)
(pred_3 obj_12 obj_11)
(pred_4 obj_14 obj_05)
(pred_3 obj_14 obj_10)
(pred_3 obj_14 obj_09)
(pred_2 obj_08 obj_03)
(pred_2 obj_04 obj_03)
(pred_2 obj_01 obj_13)
(pred_2 obj_06 obj_13)
)
(:goal
(and
(pred_2 obj_08 obj_05)
(pred_2 obj_04 obj_05)
(pred_2 obj_01 obj_07)
(pred_2 obj_06 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_12 obj_03) (pred_4 obj_14 obj_03))))
    (always (not (and (pred_4 obj_12 obj_05) (pred_4 obj_14 obj_05))))
  )
)
)

; plan
1. (op_1 obj_12 obj_07 obj_13)
   deleted: (pred_4 obj_12 obj_07)
   added: (pred_4 obj_12 obj_13)
   goals met: 0 of 4
2. (op_1 obj_14 obj_05 obj_13)
   deleted: (pred_4 obj_14 obj_05)
   added: (pred_4 obj_14 obj_13)
   goals met: 0 of 4
3. (op_2 obj_12 obj_06 obj_13 obj_11)
   deleted: (pred_2 obj_06 obj_13) (pred_3 obj_12 obj_11)
   added: (pred_1 obj_12 obj_06 obj_11)
   goals met: 0 of 4
4. (op_2 obj_12 obj_01 obj_13 obj_02)
   deleted: (pred_2 obj_01 obj_13) (pred_3 obj_12 obj_02)
   added: (pred_1 obj_12 obj_01 obj_02)
   goals met: 0 of 4
5. (op_1 obj_14 obj_13 obj_03)
   deleted: (pred_4 obj_14 obj_13)
   added: (pred_4 obj_14 obj_03)
   goals met: 0 of 4
6. (op_1 obj_12 obj_13 obj_07)
   deleted: (pred_4 obj_12 obj_13)
   added: (pred_4 obj_12 obj_07)
   goals met: 0 of 4
7. (op_2 obj_14 obj_04 obj_03 obj_09)
   deleted: (pred_2 obj_04 obj_03) (pred_3 obj_14 obj_09)
   added: (pred_1 obj_14 obj_04 obj_09)
   goals met: 0 of 4
8. (op_2 obj_14 obj_08 obj_03 obj_10)
   deleted: (pred_2 obj_08 obj_03) (pred_3 obj_14 obj_10)
   added: (pred_1 obj_14 obj_08 obj_10)
   goals met: 0 of 4
9. (op_1 obj_14 obj_03 obj_05)
   deleted: (pred_4 obj_14 obj_03)
   added: (pred_4 obj_14 obj_05)
   goals met: 0 of 4
10. (op_3 obj_12 obj_01 obj_07 obj_02)
   deleted: (pred_1 obj_12 obj_01 obj_02)
   added: (pred_2 obj_01 obj_07) (pred_3 obj_12 obj_02)
   goals met: 1 of 4
11. (op_1 obj_12 obj_07 obj_03)
   deleted: (pred_4 obj_12 obj_07)
   added: (pred_4 obj_12 obj_03)
   goals met: 1 of 4
12. (op_3 obj_14 obj_04 obj_05 obj_09)
   deleted: (pred_1 obj_14 obj_04 obj_09)
   added: (pred_2 obj_04 obj_05) (pred_3 obj_14 obj_09)
   goals met: 2 of 4
13. (op_3 obj_14 obj_08 obj_05 obj_10)
   deleted: (pred_1 obj_14 obj_08 obj_10)
   added: (pred_2 obj_08 obj_05) (pred_3 obj_14 obj_10)
   goals met: 3 of 4
14. (op_3 obj_12 obj_06 obj_03 obj_11)
   deleted: (pred_1 obj_12 obj_06 obj_11)
   added: (pred_2 obj_06 obj_03) (pred_3 obj_12 obj_11)
   goals met: 4 of 4
